cracked-machine/DigitalCurrentSinkV3/SW/STM32L476_DigitalCurrentSinkV3/Src/DacUtilities.c
/*
 * dac_utils.c
 *
 *  Created on: Aug 3, 2019
 *      Author: Chris Sutton
 */

#include <DacUtilities.h>
#include <DisplayManager.h>
#include "stm32l4xx_hal.h"

#include "dac.h"
#include "tim.h"
#include <stdio.h>
#include <math.h>


/* Max resolution for 16-bit timer */
#define TIMRES 				65535

/* MCU clock speed in hertz */
#define MASTERCLK 			80000000

/* DAC VREF */
#define VREF 				3.3

/* DAC resolution */
#define DACRES 				4096

/* increment amounts for nudging voltage/frequency values */
#define MAXFREQSTEP 		32
#define MAXAMPSTEP 			1

/*  DAC channel context set from user menu button selection. See IM_MenuEXTIHandler() */
uint32_t 	selected_dac_channel = DAC_CHANNEL_1;

/* Should settings be applied independently (0) in parallel (1) */
uint8_t dual_channel_mode = 0;

/* preview variables for DAC mode. These values are applied to registers
 * when user has confirmed settings in menu screens */
dacmode_t channel1_dacmode_preview = DAC_USER;
dacmode_t channel2_dacmode_preview = DAC_USER;

/* 	Preview of DAC_CHANNEL_1 output register stored as 2^12 decimal number */
uint32_t chan1_amp_count_preview = 0;

/* 	Preview of Timer6 count register stored as 2^12 decimal number.
	Default to slowest count period (TIMRES) prevents reset to zero/infinity
	NOTE: Zero value is illegal for timer ARR!	*/
uint32_t chan1_freq_count_preview = TIMRES;

/* Hertz conversion of chan1_freq_count_preview for display */
float chan1_freq_hertz = 0;

/* 	Preview of DAC_CHANNEL_2 output register stored as 2^12 decimal number */
uint32_t chan2_amp_count_preview = 0;

/* 	Preview of Timer7 count register stored as 2^12 decimal number
 	Default to slowest count period (TIMRES) prevents reset to zero/infinity */
 uint32_t chan2_freq_count_preview = TIMRES;

 /* Hertz conversion of chan2_freq_count_preview for display */
float chan2_freq_hertz = 0;

/**
  * @brief 	set temporary DAC mode (to be applied later on confirmation)
  *
  * @param  pNewMode The new DAC mode
  *         This parameter can be one of the following values:
  *            		DAC_ERROR 	= 	0x00,	// illegal channel request
  *					DAC_USER 	=	0x01,
  *					DAC_AUTO		= 	0x02,
  *					DAC_RAND	= 	0x03
  *
  * @retval none
  */

void DU_SetDACModePreview(uint32_t Channel, dacmode_t pNewMode)
{
	if(Channel == DAC_CHANNEL_1)
		channel1_dacmode_preview = pNewMode;
	else
		channel2_dacmode_preview = pNewMode;

}

/**
  * @brief 	get the temporary DAC mode
  *
  *
  * @retval DAC mode
  *         This parameter can be one of the following values:
  *            		DAC_ERROR 	= 	0x00,	// illegal channel request
  *					DAC_USER 	=	0x01,
  *					DAC_AUTO		= 	0x02,
  *					DAC_RAND	= 	0x03
  */

dacmode_t DU_GetDACModePreview(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
		return channel1_dacmode_preview;
	else
		return channel2_dacmode_preview;
}



char* DU_GetDACModePreview2String(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
	{
		switch(channel1_dacmode_preview)
		{
			case DAC_USER:
				return "USER";
				break;
			case DAC_RAND:
				return "RAND";
				break;
			case DAC_AUTO:
				return "AUTO";
				break;
			default:
				break;
		}
	}
	else
	{
		switch(channel2_dacmode_preview)
		{
			case DAC_USER:
				return "USER";
				break;
			case DAC_RAND:
				return "RAND";
				break;
			case DAC_AUTO:
				return "AUTO";
				break;
			default:
				break;

		}
	}

	// something went wrong
	return "ERR:DU146";

}



/**
  * @brief 	Calculate the DAC channel output voltage based
  *  		on chanX_amp_count_preview or DOR register
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	preview Select chanX_amp_count_preview or DOR register
  *
  * @retval DAC channel output voltage
  */

float DU_CalcDACVolts(uint32_t Channel, uint8_t preview)
{
	float result = 0;
	if(Channel == DAC_CHANNEL_1)
	{
		if(preview)
			result = (float)(VREF * ((float)chan1_amp_count_preview/(float)DACRES));
		else
			result = (float)(VREF * ((float)hdac1.Instance->DOR1/(float)DACRES));
	}
	if(Channel == DAC_CHANNEL_2)
	{
		if(preview)
			result = (float)(VREF * ((float)chan2_amp_count_preview/(float)DACRES));
		else
			result = (float)(VREF * ((float)hdac1.Instance->DOR2/(float)DACRES));
	}
	return result;
}

/**
  * @brief	Calculate new register value for DAC output register (DOR) in decimal-counted binary
  *
  *
  * @param volts The requested voltage to be converted
  *
  * @retval The decimal-counted binary version of the volts parameter
  */

uint32_t _CalcNewDOR(float volts)
{
	uint32_t result = (volts * DACRES) / VREF;
	return result;
}

/**
  * @brief	Calculate new register value for auto-reload register (ARR) in decimal-counted binary
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	hertz The frequency to convert to decimal-counted binary
  *
  *
  * @retval The decimal-counted binary version of the hertz parameter
  */

uint16_t _CalcNewARR(uint16_t Channel, float hertz)
{
	uint32_t result = 0;
	if(Channel == DAC_CHANNEL_1)
		result = (MASTERCLK / hertz) / htim6.Instance->PSC;
	if(Channel == DAC_CHANNEL_2)
		result = (MASTERCLK / hertz) / htim7.Instance->PSC;
	// clamp new ARR max to timer resolution, increase the PSC to get a lower ARR ceiling
	if(result > TIMRES)
		result = TIMRES;
	return result;
}



/**
  * @brief	Calculate the Timer frequency based
  *  		on chanX_freq_count_preview or auto-reload (ARR) register
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	preview Select the chanX_freq_count_preview or auto-reload (ARR) register
  *
  * @retval The calculated frequency of the timer
  */

float DU_CalcDACFreq(uint32_t Channel, uint8_t preview)
{
	float result = 0;
	if(Channel == DAC_CHANNEL_1)
	{
		if(preview)
			result = (float)MASTERCLK/((float)htim6.Instance->PSC * (float)chan1_freq_count_preview);
		else
			result = (float)MASTERCLK/((float)htim6.Instance->PSC * (float)htim6.Instance->ARR);
	}
	if(Channel == DAC_CHANNEL_2)
	{
		if(preview)
			result = (float)MASTERCLK/((float)htim7.Instance->PSC * (float)chan2_freq_count_preview);
		else
			result = (float)MASTERCLK/((float)htim7.Instance->PSC * (float)htim7.Instance->ARR);
	}
	return result;
}



/**
  * @brief Set chan1_amp_count_preview to new voltage
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	new_volts The new voltage value to set to chan1_amp_count_preview
  *
  * @retval none
  */

void DU_SetVoltagePreview(uint32_t Channel, float new_volts)
{
	if (Channel == DAC_CHANNEL_1)
	{
		chan1_amp_count_preview = _CalcNewDOR(new_volts);
		printf("New DAC_CHANNEL_1 Volt Request: %2.2fV\n", (float)DU_CalcDACVolts(DAC_CHANNEL_1, 1));
	}

	else if (Channel == DAC_CHANNEL_2)
	{
		chan2_amp_count_preview = _CalcNewDOR(new_volts);
		printf("New DAC_CHANNEL_2 Volt Request: %2.2fV\n", (float)DU_CalcDACVolts(DAC_CHANNEL_2,1));
	}
}

/**
  * @brief	Set the DAC DHR12R1 register to output a new voltage value
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void DU_SetVoltage(uint32_t Channel)
{
	// start debug counter (DAC requires 1-3 cycles before completing conversion)
	__HAL_TIM_CLEAR_FLAG(&htim15, TIM_FLAG_UPDATE);
	HAL_TIM_Base_Start_IT(&htim15);

	if(DU_isDualChannelMode())
	{
		// update register from the preview variable
		if(chan1_amp_count_preview > (DACRES-1))
		{
			hdac1.Instance->DHR12R1 = (DACRES-1);
			chan1_amp_count_preview = (DACRES-1);
		}
		else
		{
			hdac1.Instance->DHR12R1 = chan1_amp_count_preview;
		}
		// update register from the preview variable
		if(chan2_amp_count_preview > (DACRES-1))
		{
			hdac1.Instance->DHR12R2 = (DACRES-1);
			chan2_amp_count_preview = (DACRES-1);
		}
		else
		{
			hdac1.Instance->DHR12R2 = chan2_amp_count_preview;
		}
	}
	else
	{
		if (Channel == DAC_CHANNEL_1)
		{
			// update register from the preview variable
			if(chan1_amp_count_preview > (DACRES-1))
			{
				hdac1.Instance->DHR12R1 = (DACRES-1);
				chan1_amp_count_preview = (DACRES-1);
			}
			else
			{
				hdac1.Instance->DHR12R1 = chan1_amp_count_preview;
			}

