cracked-machine/DigitalCurrentSinkV3/SW/STM32L476_DigitalCurrentSinkV3/Src/DacUtilities.c
		if((chan1_freq_count_preview < 1) | (chan1_freq_count_preview > TIMRES))
			chan1_freq_count_preview = TIMRES;

	}
	else if (Channel == DAC_CHANNEL_2)
	{
		// decrement cycle period to increase frequency
		if(increase)
			chan2_freq_count_preview -= MAXFREQSTEP;
		else
			chan2_freq_count_preview += MAXFREQSTEP;

		if((chan2_freq_count_preview < 1) | (chan2_freq_count_preview > TIMRES))
			chan2_freq_count_preview = TIMRES;

	}
}

/**
  * @brief 	Cycle to next DAC mode
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void _CycleDACMode(uint32_t Channel)
{
	uint8_t currentDacMode = DU_GetDACModeActual(Channel);
	if(currentDacMode == DAC_USER)
	{
		DU_SetDACModeActual(Channel, DAC_AUTO);
	}
	else if (currentDacMode == DAC_AUTO)
	{
		DU_SetDACModeActual(Channel, DAC_RAND);
	}
	else if (currentDacMode == DAC_RAND)
	{
		DU_SetDACModeActual(Channel, DAC_USER);
	}
}

/**
  * @brief Increase selected DAC channel voltage or frequency
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void DU_IncreaseDAC(uint32_t Channel)
{
	DM_SetBlinkTimer(1);
	uint8_t currentDacMode = DU_GetDACModeActual(Channel);
	if(currentDacMode == DAC_USER)
	{
		_ChangeVoltage(Channel, 1);
		DU_SetVoltage(Channel);
	}
	else if (currentDacMode == DAC_AUTO)
	{
		_ChangeFreq(Channel, 1);
		DU_SetFreq(Channel);
	}
	else if (currentDacMode == DAC_RAND)
	{
		_ChangeFreq(Channel, 1);
		DU_SetFreq(Channel);
	}
}

/**
  * @brief  Decrease selected DAC channel voltage or frequency
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)

  * @retval none
  */

void DU_DecreaseDAC(uint32_t Channel)
{
	DM_SetBlinkTimer(1);
	uint8_t currentDacMode = DU_GetDACModeActual(Channel);
	if(currentDacMode == DAC_USER)
	{
		_ChangeVoltage(Channel, 0);
		DU_SetVoltage(Channel);
	}
	else if (currentDacMode == DAC_AUTO)
	{
		_ChangeFreq(Channel, 0);
		DU_SetFreq(Channel);
	}
	else if (currentDacMode == DAC_RAND)
	{
		_ChangeFreq(Channel, 0);
		DU_SetFreq(Channel);
	}
}

/**
  * @brief	Return the current DAC mode for the selected channel as enumerated value
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval  The DAC mode
  * 		@arg	DAC_ERROR: 	illegal mode request
  *			@arg 	DAC_USER:	Normal mode
  *			@arg 	DAC_AUTO:	Auto mode
  *			@arg 	DAC_RAND:	Random mode
  */

dacmode_t DU_GetDACModeActual(uint32_t Channel)
{
	volatile uint32_t hdac_cr = hdac1.Instance->CR;
	if (Channel == DAC_CHANNEL_1)
	{
		if	(hdac_cr & DAC_CR_WAVE1_0)
		{
			return DAC_RAND;
		}
		else if (hdac_cr & DAC_CR_WAVE1_1)
		{
			return DAC_AUTO;
		}
		else
		{
			return DAC_USER;
		}
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		if	(hdac_cr & DAC_CR_WAVE2_0)
		{
			return DAC_RAND;
		}
		else if (hdac_cr & DAC_CR_WAVE2_1)
		{
			return DAC_AUTO;
		}
		else
		{
			return DAC_USER;
		}
	}
	else
	{
		return DAC_ERROR;
	}
}

/**
  * @brief	Return the current DAC mode for the selected channel as string
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval  The DAC mode
  *
  */

char* DU_GetDACModeActual2String(uint32_t Channel)
{
	volatile uint32_t hdac_cr = hdac1.Instance->CR;
	if (Channel == DAC_CHANNEL_1)
	{
		if	(hdac_cr & DAC_CR_WAVE1_0)
		{
			return "RAND";
		}
		else if (hdac_cr & DAC_CR_WAVE1_1)
		{
			return "AUTO";
		}
		else
		{
			return "USER";
		}
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		if	(hdac_cr & DAC_CR_WAVE2_0)
		{
			return "RAND";
		}
		else if (hdac_cr & DAC_CR_WAVE2_1)
		{
			return "AUTO";
		}
		else
		{
			return "USER";
		}
	}
	else
	{
		return "Error";
	}

}

/**
  * @brief Set the DAC mode, resets the preview values
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	mode The selected DAC mode
  * 			@arg 	DAC_ERROR: 	illegal mode request
  *				@arg 	DAC_USER:	Normal mode
  *				@arg 	DAC_AUTO:	Auto mode
  *				@arg 	DAC_RAND:	Random mode
  *
  * @retval none
  */

void DU_SetDACModeActual(uint32_t Channel, dacmode_t mode)
{

	if (Channel == DAC_CHANNEL_1)
	{
		hdac1.Instance->CR &= ~(DAC_CR_WAVE1_Msk | DAC_CR_MAMP1_Msk);
		if(mode == DAC_USER)
		{
			htim6.Instance->PSC = 255;
			hdac1.Instance->CR &= ~(DAC_CR_WAVE1_0 | DAC_CR_WAVE1_1);
			//_ResetDACVoltage(DAC_CHANNEL_1);
		}
		else if (mode == DAC_RAND)
		{
			htim6.Instance->PSC = 4096;
			hdac1.Instance->CR |= (DAC_CR_WAVE1_0 | DAC_LFSRUNMASK_BITS11_0);
			//_ResetDACFreq(DAC_CHANNEL_1);
		}
		else if (mode == DAC_AUTO)
		{
			htim6.Instance->PSC = 255;
			hdac1.Instance->CR |= (DAC_CR_WAVE1_1 | DAC_TRIANGLEAMPLITUDE_4095);
			//_ResetDACFreq(DAC_CHANNEL_1);
		}
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		hdac1.Instance->CR &= ~(DAC_CR_WAVE2_Msk | DAC_CR_MAMP2_Msk);
		if(mode == DAC_USER)
		{
			htim7.Instance->PSC = 255;
			hdac1.Instance->CR &= ~(DAC_CR_WAVE2_0 | DAC_CR_WAVE2_1);
			//_ResetDACVoltage(DAC_CHANNEL_2);
		}
		else if (mode == DAC_RAND)
		{
			htim7.Instance->PSC = 4096;
			hdac1.Instance->CR |= (DAC_CR_WAVE2_0 | (DAC_LFSRUNMASK_BITS11_0 << (Channel & 0x10UL)));
			//_ResetDACFreq(DAC_CHANNEL_2);
		}
		else if (mode == DAC_AUTO)
		{
			htim7.Instance->PSC = 255;
			hdac1.Instance->CR |= (DAC_CR_WAVE2_1 | (DAC_TRIANGLEAMPLITUDE_4095 << (Channel & 0x10UL)));
			//_ResetDACFreq(DAC_CHANNEL_2);
		}
	}

